app/views/kinds/index.html.erb


<h1><%="#{t('messages.listing')} #{Kind.model_name.human(count: @kinds.count)}" %></h1>
---
SELECT "kinds".* FROM "kinds"
SELECT COUNT(*) FROM "kinds"