app/views/phones/index.html.erb

SELECT "phones".* FROM "phones"
SELECT COUNT(*) FROM "phones"
---

<h1><%="#{t('messages.listing')} #{Phone.model_name.human(count: @phones.count)}" %></h1>