app/views/contacts/_form.html.erb

    <%= adress_fields.label :state %><br>
   <%= adress_fields.select :state, options_for_states(@contact.adress.state) %>
---
SELECT  "adresses".* FROM "adresses" WHERE "adresses"."contact_id" = ? LIMIT 1  [["contact_id", 13]]