app/views/adresses/index.html.erb


<h1><%="#{t('messages.listing')} #{Adress.model_name.human(count: @adresses.count)}" %></h1>
---
SELECT "adresses".* FROM "adresses"
SELECT COUNT(*) FROM "adresses"