app/controllers/contacts_controller.rb

  def index
    @contacts = Contact.order(:name).page(params[:page]).per(15)
---
SELECT  "contacts".* FROM "contacts"  ORDER BY "contacts"."name" ASC LIMIT 15 OFFSET 90
SELECT COUNT(*) FROM "contacts"

  def update
    respond_to do |format|
      if @contact.update(contact_params)
---
UPDATE "contacts" SET "kind_id" = ?, "updated_at" = ? WHERE "contacts"."id" = ?  [["kind_id", 2], ["updated_at", "2017-02-13 18:16:40.526801"], ["id", 2]]

  def set_options_for_select
    @kind_options_for_select = Kind.all
---
SELECT "kinds".* FROM "kinds"