app/controllers/kinds_controller.rb

  def index
    @kinds = Kind.all
---
SELECT "kinds".* FROM "kinds"

  def create
    @kind = Kind.new(kind_params)

    respond_to do |format|
      if @kind.save
---
INSERT INTO "kinds" ("description", "created_at", "updated_at") VALUES (?, ?, ?)  [["description", "Amigo"], ["created_at", "2017-02-13 12:20:36.067094"], ["updated_at", "2017-02-13 12:20:36.067094"]]

  def update
    respond_to do |format|
      if @kind.update(kind_params)
---
UPDATE "kinds" SET "description" = ?, "updated_at" = ? WHERE "kinds"."id" = ?  [["description", "Amigos"], ["updated_at", "2017-02-13 12:21:25.029964"], ["id", 1]]

    def set_kind
      @kind = Kind.find(params[:id])
---
SELECT  "kinds".* FROM "kinds" WHERE "kinds"."id" = ? LIMIT 1  [["id", 1]]